
#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");

    /// 1 вывести в консоль привет
    
    /// cout << "Привет";
    
    /// 2 вывести в консоль сумму 1 + 1
    
    /// cout << 1 + 1;

    /// 3 пользователь вводит переменную, вывести квадрат 

    /*int x;
    cin >> x;
    cout << x*x;*/

    /// 4 вывести сумму двух чисел и разность
     
    /// cout << 1 + 1 << 2 - 1;
     
    /// 5 вывести среднее арифметическое трех переменных

    /*int x, y, z;
    cin >> x >> y >> z;
    cout << (x + y + z) / 3;*/
     
    /// 6 вывести деление 10 и 12 десятичной дробью

    /// cout << float(10 / 12);
     
    /// 7 пользователь вводит переменную после из нее вычитается 10 если результат отрицательный выводится ERROR
     
    /*int num1, rez;
    cin >> num1;
    rez = num1 - 10;
    if (rez < 0) cout << "ERROR";*/
     
    /// 8 если сумма будет равна нулю выводится ERROR
     
    /*int xyz;

    xyz = 10 - 10;

    if (xyz == 0) cout << "ERROR";*/
     
    /// 9 пользователь вводит число если оно не делится нацело на 2 выводится ERROR
     
    /*int x;
    cin >> x;
    if (x % 2 != 0) cout << "ERROR";*/

    /// 10 пользователь вводит переменную, и проверяется на что она делится нацело, 2 , 3 или 5
     
    /*int num;
    cin >> num;
    if (num % 2 == 0) cout << "Делится на 2";
    else if (num % 3 == 0) cout << "Делится на 3";
    else if (num % 5 == 0) cout << "Делится на 5";*/
     
    /// 11 пользователь вводит число программа проверяет равно ли оно нулю и если нет то делится ли на 2
     
    /*int x;
    cin >> x;
    if (x > 0) {
        cout << "Больше нуля" << endl;
        if (x % 2 == 0) cout << "Делится на 2";
    }
    else cout << "Меньше нуля";*/

    /// 12 пользователь вводит три числа, программа выбирает из них наибольшее
     
    /*int x, y, z;
    cin >> x >> y >> z;
    if (x > y && x > z) cout << x << " " << " - наибольшее";
    else if (y > x && y > z) cout << y << " " << " - наибольшее";
    else cout << z << " " << " - наибольшее";*/

    /// 13 пользователь вводит число и программа проверяет больше ли оно нуля или нет
     
    /*int x;
    cin >> x;
    cout << ( x>0? "Больше нуля" : "Меньше нуля");*/
     
    /// 14 пользователь вводит 3 числа программа проверяет больше ли сумма третьей переменной
     
    /*int x, y, z;
    cin >> x >> y >> z;
    cout << ((x + y) > z) ? "Больше" : "Меньше";*/

    /// 15
     
     
    /// 16 пользователь вводит цифру от 1 до 3 и программа выводит слова при выборе цифры
     
   /* int a;
    cin >> a;
    switch (a) {
        case 1: {
            cout << "привет";
            break;
    }
        case 2: {
            cout << "пока";
            break;
        }
        case 3: {
            cout << "как дела";
            break;
        }
        default: cout << "вы ввели не ту цифру!";
    }*/
     
    /// 17
     
     
    /// 18
}
